Repository: MeN1na/Student-Affairs-Management-System1
Catalog: Resources/Resource.*.resx
Languages: ar_eg

source: Academic Email
ar_eg: الايميل الجامعي

# AcademicEmailinfo
source: Access your official university email for important updates, communications, and announcements regarding your application.
ar_eg: قم بالوصول إلى بريدك الإلكتروني الرسمي الخاص بالجامعة للحصول على التحديثات الهامة والاتصالات والإعلانات المتعلقة بطلبك.

# AcademicEmailstudent
source: Access your academic email to stay connected with faculty, receive course updates, and manage university communications.
ar_eg: الايميل الجامعي

source: Age
ar_eg: العمر

source: Applicant
ar_eg: مستجد

source: Applicant Registration
ar_eg: تسجيل المستجدين

source: Applicants
ar_eg: المتقدمين

source: Application Requirements
ar_eg: متطلبات التقديم

# ApplicationRequirementsinfo
source: Review the essential documents and criteria needed to complete your application process successfully.
ar_eg: قم بمراجعة المستندات والمعايير الأساسية اللازمة لإكمال عملية التقديم الخاصة بك بنجاح.

source: Bifurcation Services
ar_eg: خدمـات التشعيب

# BifurcationServicesinfo
source: Learn more about bifurcation options available for students to split their course load across multiple semesters or academic terms.
ar_eg: تعرف على المزيد حول الاقسام المتاحة للطلاب للتشعيب.

source: Clear
ar_eg: مسح

source: Department
ar_eg: القسم

source: Email
ar_eg: البريد الالكتروني

source: Employee
ar_eg: موظف

source: Employee Registration
ar_eg: التسجيل كوظف

source: Employees
ar_eg: الموظفين

source: Enter your age
ar_eg: ادخل عمرك

source: Enter your Department
ar_eg: القسم المنتمي اليه

source: Enter your email
ar_eg: ادخل بريدك الالكتروني

source: Enter your mobile
ar_eg: ادخل رقم هاتفك

source: Enter your name
ar_eg: ادخل اسمك

source: Enter your role
ar_eg: ادخل المسمي الوظيفي

source: Enter your Scholarship
ar_eg: ادخل نوع المنحة الدراسية

source: Enter your school name
ar_eg: ادخل اسم مدرستك للمرحلة الثانوية

source: Explore Options
ar_eg: المزيد

source: Faculty Staff
ar_eg: أعضاء هيئة التدريس

source: Faculty Staff Registration
ar_eg: تسجيل أعضاء هيئة التدريس

source: Go to Email
ar_eg: اذهب للايميل

source: Home
ar_eg: الصفحة الرئيسية

source: Id
ar_eg: الرقم التعريفي

source: Information Table
ar_eg: البيانات

source: Job Description Guide
ar_eg: دليل الوصف الوظيفي

# JobDescriptionGuideinfo
source: Guidelines for writing effective job descriptions.
ar_eg: المبادئ التوجيهية لكتابة التوصيف الوظيفي الفعال.

source: Jobs
ar_eg: الوظائف

# Jobsinfo
source: Explore job opportunities and descriptions.
ar_eg: اطلع علي فرص العمل المتاحة و كيفية التقديم.

source: Manage Accommodation
ar_eg: إدارة الإقامة

source: Mobile
ar_eg: رقم الهاتف

source: Name
ar_eg: الاسم

source: Operations
ar_eg: العملية

source: Our Services
ar_eg: خدماتنا

source: Read Guide
ar_eg: قراءة الدليل

source: Register as a/an
ar_eg: قم بالتسجيل ك

source: Registered Applicants
ar_eg: المستجدين بالجامعة

source: Registered Employees
ar_eg: الموظفين بالجامعة

source: Registered Faculty Staff
ar_eg: اعضاء هيئة التدريس

source: Registered Students
ar_eg: الطلاب المقيدون بالجامعة

source: Reset
ar_eg: الغاء

source: Role
ar_eg: الوظيفة

source: Scholarships
ar_eg: المنح الدراسية

# Scholarshipsinfo
source: Explore a range of scholarship opportunities available to applicants and check the status of your current applications.
ar_eg: استكشف مجموعة من فرص المنح الدراسية المتاحة للمتقدمين وتحقق من حالة طلباتك الحالية.

source: Scholarship Type
ar_eg: نوع المنحة الدراسية

source: Secondary School Name
ar_eg: المدرسة الثانوية

source: Start Transfer
ar_eg: متطلبات التحويل

source: Status Statement
ar_eg: بيان حالة الموظف

# StatusStatementinfo
source: creating a clear and concise document that outlines the employee's current position, employment status, and relevant details.
ar_eg: إنشاء مستند واضح وموجز يوضح المنصب الحالي للموظف وحالته الوظيفية والتفاصيل ذات الصلة.

source: Student
ar_eg: طالب

source: Student Accommodation
ar_eg: سكن الطلاب

# StudentAccommodationinfo
source: Find accommodation options on and off-campus, and submit your housing application or manage existing requests.
ar_eg: ابحث عن خيارات الإقامة داخل السكن الجامعي وخارجه، وقدم طلب السكن الخاص بك أو قم بإدارة الطلبات الحالية.

source: Student Affairs Management System
ar_eg: نظام شئون الطلبة

source: Student Registration
ar_eg: التسجيل كطالب

source: Students
ar_eg: الطلاب

source: Submit
ar_eg: تسجيل

source: Transfer Service
ar_eg: خدمات التحويل

# TransferServiceinfo
source: Discover how to transfer between different departments or universities and manage your transfer application.
ar_eg: اكتشف كيفية التحويل بين الأقسام أو الجامعات المختلفة وإدارة طلب التحويل الخاص بك.

source: View
ar_eg: عرض

source: View Details
ar_eg: عرض التفاصيل

source: View Jobs
ar_eg: عرض الوظائف

source: Welcome to Selim University
ar_eg: اهلا بك في جامعة سليم
